tap "auth0/auth0-cli"
tap "hashicorp/tap"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "pulumi/tap"
tap "qmk/qmk"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Curl like simplicity to access AWS resources
brew "awscurl"
# GNU binary tools for native development
brew "binutils"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Lightweight, framework-agnostic database migration tool
brew "dbmate"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Command-line tools for fly.io services
brew "flyctl"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# CLI for Infisical
brew "infisical"
# Apache Kafka C/C++ library
brew "librdkafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Mac App Store CLI (used in Brewfile to install Magnet etc.)
brew "mas"
# QUIC transport protocol implementation
brew "mvfst"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# OCaml package manager
brew "opam"
# Tool for managing OCI containers and pods
brew "podman"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@16"
# Proof assistant for higher-order logic
brew "rocq"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Command-line client for WebSockets
brew "websocat"
# Symlink farm manager — used by bootstrap.sh to install dotfiles
brew "stow"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Build, manage and test your Auth0 integrations from the command line
brew "auth0/auth0-cli/auth0"
# Terraform
brew "hashicorp/tap/terraform"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# --- editors / terminals ---
cask "cursor"
cask "ghostty"
cask "sublime-text"
cask "visual-studio-code"
cask "warp"
cask "zed"

# --- dev tools ---
cask "docker-desktop"
cask "msty"
cask "ollama"
cask "session-manager-plugin"
cask "wireshark-app"
cask "wkhtmltopdf"

# --- browsers ---
cask "arc"
cask "firefox"
cask "google-chrome"

# --- ai ---
cask "chatgpt"
cask "claude"

# --- comms ---
cask "discord"
cask "linear"
cask "microsoft-teams"
cask "signal"
cask "slack"
cask "superhuman"
cask "telegram"
cask "whatsapp"
cask "zoom"

# --- utilities ---
cask "1password"
cask "adobe-acrobat-reader"
cask "google-drive"
cask "kap"
cask "notion"
cask "spotify"
cask "stats"
cask "tailscale-app"

# --- mac app store (needs `mas` CLI; brew installs that for us) ---
mas "Magnet", id: 441258766
vscode "1yib.rust-bundle"
vscode "adamsome.vscode-theme-gruvbox-minor"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "dbaeumer.vscode-eslint"
vscode "dustypomerleau.rust-syntax"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.vscode-typescript-next"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "vadimcn.vscode-lldb"
vscode "vscjava.vscode-java-pack"
vscode "yzhang.markdown-all-in-one"
cargo "cargo-leptos"
cargo "cargo-llvm-cov"
cargo "cargo-nextest"
cargo "cargo-show-asm"
cargo "flamegraph"
cargo "leptosfmt"
cargo "samply"
cargo "sqlx-cli"
cargo "trunk"
cargo "wasm-bindgen-cli"
cargo "wasm-opt"
