1yib.rust-bundle
adamsome.vscode-theme-gruvbox-minor
amazonwebservices.aws-toolkit-vscode
anthropic.claude-code
dbaeumer.vscode-eslint
dustypomerleau.rust-syntax
esbenp.prettier-vscode
fill-labs.dependi
foxundermoon.shell-format
github.vscode-github-actions
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.vscode-typescript-next
pkief.material-icon-theme
redhat.java
rust-lang.rust-analyzer
vadimcn.vscode-lldb
vscjava.vscode-java-pack
yzhang.markdown-all-in-one
