1yib.rust-bundle
adamsome.vscode-theme-gruvbox-minor
amazonwebservices.aws-toolkit-vscode
anthropic.claude-code
apsislabs.mergetool-navigator
dbaeumer.vscode-eslint
dustypomerleau.rust-syntax
esbenp.prettier-vscode
fill-labs.dependi
foxundermoon.shell-format
github.vscode-github-actions
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-js-profile-flame
ms-vscode.vscode-typescript-next
pkief.material-icon-theme
redhat.java
redhat.vscode-xml
rust-lang.rust-analyzer
swmansion.react-native-ide
vadimcn.vscode-lldb
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
waderyan.gitblame
yzhang.markdown-all-in-one
